In [1]:
import numpy as np
import pandas as pd

In [2]:
# ÂºïÂÖ•Âá†‰∏™Á§∫‰æãÊï∞ÊçÆÊñπ‰æøÂ±ïÁé∞Áî®Ê≥ï
index = pd.date_range("3/29/2022", periods=8)

s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
print(s)

df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
df

a    1.019261
b    0.141626
c   -0.539188
d   -0.958018
e   -0.701520
dtype: float64

                   A         B         C
2022-03-29  0.387345  0.082881  0.679417
2022-03-30  0.682997  0.010067 -0.196750
2022-03-31 -1.497663 -0.990778  0.997499
2022-04-01 -1.812887  1.095128 -0.321763
2022-04-02 -1.514897 -0.024382  2.074509
2022-04-03  0.373081 -0.307427 -0.365745
2022-04-04 -0.175499  0.853487  0.777809
2022-04-05 -1.284925  0.825700 -0.282665

# head( ) Âíå tail( )
To view a small sample of a `Series` or `DataFrame` object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number.

In [3]:
long_series = pd.Series(np.random.randn(1000))
long_series.head()  # ÈªòËÆ§ÊòæÁ§∫Â§¥ÈÉ®‰∫î‰∏™Êï∞ÊçÆ

0   -0.912943
1    0.322801
2   -0.281748
3   -2.409908
4    0.204572
dtype: float64

In [4]:
long_series.head(10)  # Ëá™ÂÆö‰πâÊòæÁ§∫Â§¥ÈÉ®ÁöÑÊï∞ÊçÆÁöÑ‰∏™Êï∞

0   -0.912943
1    0.322801
2   -0.281748
3   -2.409908
4    0.204572
5   -0.217229
6    0.945846
7    0.930979
8   -1.245430
9    1.154846
dtype: float64

In [5]:
long_series.tail()  # ÈªòËÆ§ÊòæÁ§∫Â∞æÈÉ®‰∫î‰∏™Êï∞ÊçÆ

995    2.609140
996    1.363360
997    0.477261
998   -0.657334
999   -0.904815
dtype: float64

In [6]:
long_series.tail(10)  # Ëá™ÂÆö‰πâÊòæÁ§∫Â∞æÈÉ®ÁöÑÊï∞ÊçÆÁöÑ‰∏™Êï∞

990    0.840553
991   -0.999899
992    0.832940
993    1.571671
994    0.103261
995    2.609140
996    1.363360
997    0.477261
998   -0.657334
999   -0.904815
dtype: float64

# attributes and underlying data  Â±ûÊÄßÂíåÂ∫ïÂ±ÇÊï∞ÊçÆ

In [7]:
df

                   A         B         C
2022-03-29  0.387345  0.082881  0.679417
2022-03-30  0.682997  0.010067 -0.196750
2022-03-31 -1.497663 -0.990778  0.997499
2022-04-01 -1.812887  1.095128 -0.321763
2022-04-02 -1.514897 -0.024382  2.074509
2022-04-03  0.373081 -0.307427 -0.365745
2022-04-04 -0.175499  0.853487  0.777809
2022-04-05 -1.284925  0.825700 -0.282665

In [8]:
df[:3]

                   A         B         C
2022-03-29  0.387345  0.082881  0.679417
2022-03-30  0.682997  0.010067 -0.196750
2022-03-31 -1.497663 -0.990778  0.997499

In [9]:
df.columns = [x.lower() for x in df.columns]

In [10]:
df

                   a         b         c
2022-03-29  0.387345  0.082881  0.679417
2022-03-30  0.682997  0.010067 -0.196750
2022-03-31 -1.497663 -0.990778  0.997499
2022-04-01 -1.812887  1.095128 -0.321763
2022-04-02 -1.514897 -0.024382  2.074509
2022-04-03  0.373081 -0.307427 -0.365745
2022-04-04 -0.175499  0.853487  0.777809
2022-04-05 -1.284925  0.825700 -0.282665

In [11]:
df.columns = [9, 'you', '88']
df

                   9       you        88
2022-03-29  0.387345  0.082881  0.679417
2022-03-30  0.682997  0.010067 -0.196750
2022-03-31 -1.497663 -0.990778  0.997499
2022-04-01 -1.812887  1.095128 -0.321763
2022-04-02 -1.514897 -0.024382  2.074509
2022-04-03  0.373081 -0.307427 -0.365745
2022-04-04 -0.175499  0.853487  0.777809
2022-04-05 -1.284925  0.825700 -0.282665

In [12]:
s

a    1.019261
b    0.141626
c   -0.539188
d   -0.958018
e   -0.701520
dtype: float64

In [13]:
# Â∞Ü s ËΩ¨Êç¢‰∏∫ NumPy array
s.to_numpy()

array([ 1.01926089,  0.14162632, -0.53918817, -0.95801756, -0.70151996])

In [14]:
# ÊàñËÄÖ‰ΩøÁî® asarray( ) ÊñπÊ≥ï
np.asarray(s)

array([ 1.01926089,  0.14162632, -0.53918817, -0.95801756, -0.70151996])

In [15]:
df

                   9       you        88
2022-03-29  0.387345  0.082881  0.679417
2022-03-30  0.682997  0.010067 -0.196750
2022-03-31 -1.497663 -0.990778  0.997499
2022-04-01 -1.812887  1.095128 -0.321763
2022-04-02 -1.514897 -0.024382  2.074509
2022-04-03  0.373081 -0.307427 -0.365745
2022-04-04 -0.175499  0.853487  0.777809
2022-04-05 -1.284925  0.825700 -0.282665

In [16]:
# When your DataFrame only has a single data type for all the columns, DataFrame.to_numpy() will return the underlying data.
# Â∞Ü df ËΩ¨Êç¢‰∏∫ NumPy array
df.to_numpy()

array([[ 0.3873447 ,  0.08288094,  0.67941699],
       [ 0.68299721,  0.01006666, -0.19675048],
       [-1.49766308, -0.99077762,  0.99749916],
       [-1.81288705,  1.09512804, -0.32176251],
       [-1.51489661, -0.02438215,  2.07450913],
       [ 0.37308128, -0.30742667, -0.36574476],
       [-0.17549932,  0.85348699,  0.77780924],
       [-1.28492539,  0.82570037, -0.28266546]])

# matching / broadcasting behavior   ÂåπÈÖçË°å‰∏∫ / ÂπøÊí≠Ë°å‰∏∫

In [17]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.arange(3, 6), index=["a", "b", "c"]),
        "two": pd.Series(np.arange(7, 11), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.arange(3), index=["b", "c", "d"]),
    }
)

df

   one  two  three
a  3.0    7    NaN
b  4.0    8    0.0
c  5.0    9    1.0
d  NaN   10    2.0

In [18]:
selected_row = df.iloc[1]
print(selected_row)

print('-'*30)

selected_column = df["two"]
print(selected_column)

one      4.0
two      8.0
three    0.0
Name: b, dtype: float64
------------------------------
a     7
b     8
c     9
d    10
Name: two, dtype: int32

### [üßê***ÂèÇËÄÉÂçöÂÆ¢***](https://blog.csdn.net/wyf2017/article/details/107459509)
---
![](https://img-blog.csdnimg.cn/20200720111708736.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L3d5ZjIwMTc=,size_16,color_FFFFFF,t_70)

In [19]:
#  Á¨¨‰∏ÄÂàóÁöÑÁ¨¨‰∏Ä‰∏™„ÄÅÁ¨¨‰∫åÂàóÁöÑÁ¨¨‰∏Ä‰∏™„ÄÅÁ¨¨‰∏âÂàóÁöÑÁ¨¨‰∏Ä‰∏™     ÂéªÂáè    selected_row
#  Á¨¨‰∏ÄÂàóÁöÑÁ¨¨‰∫å‰∏™„ÄÅÁ¨¨‰∫åÂàóÁöÑÁ¨¨‰∫å‰∏™„ÄÅÁ¨¨‰∏âÂàóÁöÑÁ¨¨‰∫å‰∏™     ÂéªÂáè    selected_row
#  Á¨¨‰∏ÄÂàóÁöÑÁ¨¨‰∏â‰∏™„ÄÅÁ¨¨‰∫åÂàóÁöÑÁ¨¨‰∏â‰∏™„ÄÅÁ¨¨‰∏âÂàóÁöÑÁ¨¨‰∏â‰∏™     ÂéªÂáè    selected_row
df.sub(selected_row, axis="columns")

   one  two  three
a -1.0 -1.0    NaN
b  0.0  0.0    0.0
c  1.0  1.0    1.0
d  NaN  2.0    2.0

In [20]:
df.sub(selected_row, axis=1)

   one  two  three
a -1.0 -1.0    NaN
b  0.0  0.0    0.0
c  1.0  1.0    1.0
d  NaN  2.0    2.0

In [21]:
#  Á¨¨‰∏ÄË°åÁöÑÁ¨¨‰∏Ä‰∏™„ÄÅÁ¨¨‰∫åË°åÁöÑÁ¨¨‰∏Ä‰∏™„ÄÅÁ¨¨‰∏âË°åÁöÑÁ¨¨‰∏Ä‰∏™     ÂéªÂáè    selected_column
#  Á¨¨‰∏ÄË°åÁöÑÁ¨¨‰∫å‰∏™„ÄÅÁ¨¨‰∫åË°åÁöÑÁ¨¨‰∫å‰∏™„ÄÅÁ¨¨‰∏âË°åÁöÑÁ¨¨‰∫å‰∏™     ÂéªÂáè    selected_column
#  Á¨¨‰∏ÄË°åÁöÑÁ¨¨‰∏â‰∏™„ÄÅÁ¨¨‰∫åË°åÁöÑÁ¨¨‰∏â‰∏™„ÄÅÁ¨¨‰∏âË°åÁöÑÁ¨¨‰∏â‰∏™     ÂéªÂáè    selected_column
df.sub(selected_column, axis="index")

   one  two  three
a -4.0    0    NaN
b -4.0    0   -8.0
c -4.0    0   -8.0
d  NaN    0   -8.0

In [22]:
df.sub(selected_column, axis=0)

   one  two  three
a -4.0    0    NaN
b -4.0    0   -8.0
c -4.0    0   -8.0
d  NaN    0   -8.0

# Comparing if objects are equivalent

In [23]:
df1 = pd.DataFrame({"col": ["foo", 0, np.nan]})
df1

   col
0  foo
1    0
2  NaN

In [24]:
df2 = pd.DataFrame({"col": [np.nan, 0, "foo"]}, index=[2, 1, 0])
df2

   col
2  NaN
1    0
0  foo

#### üò¥Note that the Series or DataFrame index needs to be in the same order for equality to be True:

In [25]:
df1.equals(df2)

False

In [26]:
df2.sort_index()

   col
0  foo
1    0
2  NaN

In [27]:
df1.equals(df2.sort_index())

True

# Index of min/max values
The idxmin() and idxmax() functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values.

In [28]:
s1 = pd.Series([2, 6, 8, -3, -10])
s1.dtype

dtype('int64')

In [29]:
s1.idxmin()

4

In [30]:
s1.idxmax()

2

In [31]:
df1 = pd.DataFrame([[2, -3, 8, 4], [9, 30, -100, 35], [23, 43, -33, -66], [423, 9, -3, -88]], columns=['you', 'and', 'me', 'forever'])
df1

   you  and   me  forever
0    2   -3    8        4
1    9   30 -100       35
2   23   43  -33      -66
3  423    9   -3      -88

In [32]:
df1.idxmin(axis='index')

you        0
and        0
me         1
forever    3
dtype: int64

In [33]:
df1.idxmin(axis=0)

you        0
and        0
me         1
forever    3
dtype: int64

In [34]:
df1.idxmax(axis='columns')

0         me
1    forever
2        and
3        you
dtype: object

In [35]:
df1.idxmax(axis=1)

0         me
1    forever
2        and
3        you
dtype: object

# Mixed dtypes &nbsp;&nbsp;&nbsp;Ê∑∑ÂêàÊï∞ÊçÆÁ±ªÂûã

In [36]:
mdf = pd.DataFrame(
    {
        "A": [1, 2, 3],
        "B": [1.0, 2.0, 3.0],
        "C": ["foo", "bar", "baz"],
        "D": pd.date_range("20130101", periods=3),
    }
)

mdf

   A    B    C          D
0  1  1.0  foo 2013-01-01
1  2  2.0  bar 2013-01-02
2  3  3.0  baz 2013-01-03

In [37]:
mdf.dtypes

A             int64
B           float64
C            object
D    datetime64[ns]
dtype: object

In [38]:
mdf.agg(["min", "sum"])

     A    B          C          D
min  1  1.0        bar 2013-01-01
sum  6  6.0  foobarbaz        NaT

# Transform API

In [39]:
tsdf = pd.DataFrame(
    np.random.randint(-30, 20, size=(10, 3)),
    columns=["A", "B", "C"],
    index=pd.date_range("3/30/2022", periods=10),
)
tsdf

             A   B   C
2022-03-30  -9 -22 -30
2022-03-31   6   6  -6
2022-04-01  -8 -17  15
2022-04-02 -29   0   6
2022-04-03 -25  12 -23
2022-04-04   3 -10  -8
2022-04-05 -18 -13  -9
2022-04-06  16  -6   0
2022-04-07  10 -20  14
2022-04-08  12  -2 -20

In [40]:
tsdf.iloc[3]

A   -29
B     0
C     6
Name: 2022-04-02 00:00:00, dtype: int32

In [41]:
tsdf.iloc[3:7]

             A   B   C
2022-04-02 -29   0   6
2022-04-03 -25  12 -23
2022-04-04   3 -10  -8
2022-04-05 -18 -13  -9

In [42]:
tsdf[3:7]

             A   B   C
2022-04-02 -29   0   6
2022-04-03 -25  12 -23
2022-04-04   3 -10  -8
2022-04-05 -18 -13  -9

In [43]:
tsdf.loc['2022-04-01']

A    -8
B   -17
C    15
Name: 2022-04-01 00:00:00, dtype: int32

In [44]:
tsdf[3:7] = np.nan
tsdf

               A     B     C
2022-03-30  -9.0 -22.0 -30.0
2022-03-31   6.0   6.0  -6.0
2022-04-01  -8.0 -17.0  15.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  16.0  -6.0   0.0
2022-04-07  10.0 -20.0  14.0
2022-04-08  12.0  -2.0 -20.0

#### üòéTransform the entire frame. .transform() allows input functions as: a NumPy function, a string function name or a user defined function.

In [45]:
tsdf.transform(np.abs)

               A     B     C
2022-03-30   9.0  22.0  30.0
2022-03-31   6.0   6.0   6.0
2022-04-01   8.0  17.0  15.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  16.0   6.0   0.0
2022-04-07  10.0  20.0  14.0
2022-04-08  12.0   2.0  20.0

In [46]:
tsdf.transform('abs')

               A     B     C
2022-03-30   9.0  22.0  30.0
2022-03-31   6.0   6.0   6.0
2022-04-01   8.0  17.0  15.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  16.0   6.0   0.0
2022-04-07  10.0  20.0  14.0
2022-04-08  12.0   2.0  20.0

In [47]:
tsdf.transform(lambda x: abs(x))

               A     B     C
2022-03-30   9.0  22.0  30.0
2022-03-31   6.0   6.0   6.0
2022-04-01   8.0  17.0  15.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  16.0   6.0   0.0
2022-04-07  10.0  20.0  14.0
2022-04-08  12.0   2.0  20.0

In [48]:
np.abs(tsdf)

               A     B     C
2022-03-30   9.0  22.0  30.0
2022-03-31   6.0   6.0   6.0
2022-04-01   8.0  17.0  15.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  16.0   6.0   0.0
2022-04-07  10.0  20.0  14.0
2022-04-08  12.0   2.0  20.0

In [49]:
tsdf["A"].transform('abs')

2022-03-30     9.0
2022-03-31     6.0
2022-04-01     8.0
2022-04-02     NaN
2022-04-03     NaN
2022-04-04     NaN
2022-04-05     NaN
2022-04-06    16.0
2022-04-07    10.0
2022-04-08    12.0
Freq: D, Name: A, dtype: float64

## Transform with multiple functions
Passing multiple functions will yield a column MultiIndexed DataFrame. The first level will be the original frame column names; the second level will be the names of the transforming functions.

In [50]:
tsdf.transform([np.abs, lambda x: x + 1000])

                  A                 B                 C
           absolute <lambda> absolute <lambda> absolute <lambda>
2022-03-30      9.0    991.0     22.0    978.0     30.0    970.0
2022-03-31      6.0   1006.0      6.0   1006.0      6.0    994.0
2022-04-01      8.0    992.0     17.0    983.0     15.0   1015.0
2022-04-02      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-03      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-04      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-05      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-06     16.0   1016.0      6.0    994.0      0.0   1000.0
2022-04-07     10.0   1010.0     20.0    980.0     14.0   1014.0
2022-04-08     12.0   1012.0      2.0    998.0     20.0    980.0

In [51]:
tsdf.transform([np.abs, lambda x: x + 1000]).columns

MultiIndex([('A', 'absolute'),
            ('A', '<lambda>'),
            ('B', 'absolute'),
            ('B', '<lambda>'),
            ('C', 'absolute'),
            ('C', '<lambda>')],
           )

Passing multiple functions to a Series will yield a DataFrame. The resulting column names will be the transforming functions.

In [52]:
tsdf["A"].transform([np.abs, lambda x: x + 1])

            absolute  <lambda>
2022-03-30       9.0      -8.0
2022-03-31       6.0       7.0
2022-04-01       8.0      -7.0
2022-04-02       NaN       NaN
2022-04-03       NaN       NaN
2022-04-04       NaN       NaN
2022-04-05       NaN       NaN
2022-04-06      16.0      17.0
2022-04-07      10.0      11.0
2022-04-08      12.0      13.0

In [53]:
tsdf["A"].transform([np.abs, lambda x: x + 1]).columns

Index(['absolute', '<lambda>'], dtype='object')

# reindexing and altering labels ÈáçÊñ∞Á¥¢ÂºïÂíåÊõ¥ÊîπÊ†áÁ≠æ

In [106]:
s1 = pd.Series(np.random.randint(-8, 20, size=5), index=['a', 'b', 'c', 'd', 'e'])
s1

a    15
b    14
c    17
d     6
e    19
dtype: int32

In [107]:
s1.reindex(['c', 'e', 'a', 'you', 'a', 'me', 'hahaha'])

c         17.0
e         19.0
a         15.0
you        NaN
a         15.0
me         NaN
hahaha     NaN
dtype: float64

In [108]:
df1 = pd.DataFrame(np.random.randint(-8, 100, size=(4, 3)), index=['a', 'b', 'c', 'd'], columns=['one', 'two', 'three'])
df1

   one  two  three
a   57   75     66
b   16   16     80
c   49   37     69
d   22   92      8

In [109]:
df1.reindex(index=['b', 'd', 'you', 'a'])

      one   two  three
b    16.0  16.0   80.0
d    22.0  92.0    8.0
you   NaN   NaN    NaN
a    57.0  75.0   66.0

In [110]:
df1.reindex(['b', 'd', 'you', 'a'], axis='index')  # axis=0 ÊòØ‰∏ÄÊ†∑ÁöÑ

      one   two  three
b    16.0  16.0   80.0
d    22.0  92.0    8.0
you   NaN   NaN    NaN
a    57.0  75.0   66.0

In [111]:
df1.reindex(columns=['two', 'happy', 'one', 'together'])

   two  happy  one  together
a   75    NaN   57       NaN
b   16    NaN   16       NaN
c   37    NaN   49       NaN
d   92    NaN   22       NaN

In [112]:
df1.reindex(['two', 'happy', 'one', 'together'], axis='columns')  # axis=1 ÊòØ‰∏ÄÊ†∑ÁöÑ

   two  happy  one  together
a   75    NaN   57       NaN
b   16    NaN   16       NaN
c   37    NaN   49       NaN
d   92    NaN   22       NaN

In [113]:
df1.reindex(index=['b', 'd', 'you', 'a'], columns=['two', 'happy', 'one', 'together'])  # index „ÄÅcolumns ÂêåÊó∂ÈáçÊñ∞Á¥¢Âºï

      two  happy   one  together
b    16.0    NaN  16.0       NaN
d    92.0    NaN  22.0       NaN
you   NaN    NaN   NaN       NaN
a    75.0    NaN  57.0       NaN

In [114]:
index_share1 = s1.reindex(df1.index)  # df1 ÁöÑ index ‰∏é s1 ÁöÑindex ÊúâÈáçÂè†ÔºåÊâÄ‰ª•ÂèØ‰ª•ÂÖ±‰∫´~
index_share1

a    15
b    14
c    17
d     6
dtype: int32

In [115]:
index_share1.index is df1.index

True

In [116]:
index_share2 = df1.reindex(s1.index, axis=0)
index_share2

    one   two  three
a  57.0  75.0   66.0
b  16.0  16.0   80.0
c  49.0  37.0   69.0
d  22.0  92.0    8.0
e   NaN   NaN    NaN

In [117]:
index_share2.index is s1.index

True

In [118]:
df = pd.DataFrame(np.random.randint(-10, 100, size=(3, 2)), index=['b', 'd', 'a'], columns=['three', 'two'])
df

   three  two
b     42   -5
d     85   -9
a     87   29

In [119]:
df1

   one  two  three
a   57   75     66
b   16   16     80
c   49   37     69
d   22   92      8

In [121]:
# reindex_like( ) ÊñπÊ≥ï
df1.reindex_like(df)

   three  two
b     80   16
d      8   92
a     66   75

# aligning objects with each other with align( )

In [130]:
s = pd.Series(np.random.randint(1, 50, size=5), index=['a', 'b', 'c', 'd', 'e'])
s

a    12
b    18
c    44
d    37
e     6
dtype: int32

In [131]:
s1 = s[:4]
s1

a    12
b    18
c    44
d    37
dtype: int32

In [132]:
s2 = s[2:]
s2

c    44
d    37
e     6
dtype: int32

In [134]:
s1.align(s2)  # ÂÆÉËøîÂõû‰∏Ä‰∏™ÂåÖÂê´‰∏§‰∏™ÈáçÊñ∞Á¥¢ÂºïSeriesÁöÑÂÖÉÁªÑ „ÄÇÈªòËÆ§ÈááÁî®Á¥¢ÂºïÁöÑÂπ∂ÈõÜÔºåÂç≥ join='outer'

(a    12.0
 b    18.0
 c    44.0
 d    37.0
 e     NaN
 dtype: float64,
 a     NaN
 b     NaN
 c    44.0
 d    37.0
 e     6.0
 dtype: float64)

In [135]:
s1.align(s2, join='left')  # join='left': use the calling object‚Äôs index

(a    12
 b    18
 c    44
 d    37
 dtype: int32,
 a     NaN
 b     NaN
 c    44.0
 d    37.0
 dtype: float64)

In [136]:
s1.align(s2, join='right')  # join='right': use the passed object‚Äôs index

(c    44.0
 d    37.0
 e     NaN
 dtype: float64,
 c    44
 d    37
 e     6
 dtype: int32)

In [138]:
s1.align(s2, join='inner')  # join='inner': intersect the indexes

(c    44
 d    37
 dtype: int32,
 c    44
 d    37
 dtype: int32)

# filling while reindexing

In [140]:
rng = pd.date_range("30/3/2022", periods=8)
rng

DatetimeIndex(['2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06'],
              dtype='datetime64[ns]', freq='D')

In [142]:
ts = pd.Series(np.random.randint(10, 100, size=8), index=rng)
ts

2022-03-30    75
2022-03-31    90
2022-04-01    78
2022-04-02    63
2022-04-03    28
2022-04-04    30
2022-04-05    23
2022-04-06    89
Freq: D, dtype: int32

In [152]:
ts2 = ts[[1, 3, 6]]
ts2

2022-03-31    90
2022-04-02    63
2022-04-05    23
dtype: int32

In [153]:
ts2.reindex(ts.index)

2022-03-30     NaN
2022-03-31    90.0
2022-04-01     NaN
2022-04-02    63.0
2022-04-03     NaN
2022-04-04     NaN
2022-04-05    23.0
2022-04-06     NaN
Freq: D, dtype: float64

In [154]:
ts2.reindex(ts.index, method='ffill')  # ÂêëÂâçÂ°´ÂÖÖÂÄº

2022-03-30     NaN
2022-03-31    90.0
2022-04-01    90.0
2022-04-02    63.0
2022-04-03    63.0
2022-04-04    63.0
2022-04-05    23.0
2022-04-06    23.0
Freq: D, dtype: float64

In [155]:
ts2.reindex(ts.index, method='bfill')  # ÂêëÂêéÂ°´ÂÖÖÂÄº

2022-03-30    90.0
2022-03-31    90.0
2022-04-01    63.0
2022-04-02    63.0
2022-04-03    23.0
2022-04-04    23.0
2022-04-05    23.0
2022-04-06     NaN
Freq: D, dtype: float64

In [156]:
ts2.reindex(ts.index, method='nearest')  # ‰ªéÊúÄËøëÁöÑÁ¥¢ÂºïÂÄºÂ°´ÂÖÖ

2022-03-30    90
2022-03-31    90
2022-04-01    63
2022-04-02    63
2022-04-03    63
2022-04-04    23
2022-04-05    23
2022-04-06    23
Freq: D, dtype: int32

These methods require that the indexes are ordered increasing or decreasing.

Note that the same result could have been achieved using fillna (except for method='nearest') or interpolate.

reindex() will raise a ValueError if the index is not monotonically increasing or decreasing. fillna() and interpolate() will not perform any checks on the order of the index.

# dropping labels from an axis

In [157]:
df1

   one  two  three
a   57   75     66
b   16   16     80
c   49   37     69
d   22   92      8

In [163]:
df1.drop(['a', 'd'], axis=0)

   one  two  three
b   16   16     80
c   49   37     69

In [164]:
df1.drop(['one', 'two'], axis=1)

   three
a     66
b     80
c     69
d      8

# renaming / mapping labels
The rename() method allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.

In [196]:
s1

a    12
b    18
c    44
d    37
dtype: int32

In [197]:
s1.rename(str.upper)

A    12
B    18
C    44
D    37
dtype: int32

In [198]:
s1.name

In [205]:
# https://blog.csdn.net/cuihuijun1hao/article/details/78155216
s1.rename("you", inplace=True)  # SeriesÁöÑ name Â±ûÊÄßÔºåÂú®ÊääËØ•SeriesËΩ¨‰∏∫DataFrameÊó∂ÔºåÂèØ‰ª•‰Ωú‰∏∫ columns ÁöÑÊ†áÁ≠æÂêç

a    12
b    18
c    44
d    37
Name: you, dtype: int32

In [206]:
pd.DataFrame(s1)

   you
a   12
b   18
c   44
d   37

**-----------------------------------------------------------------------------------------------------------------------------------------------------**

In [169]:
df

   three  two
b     42   -5
d     85   -9
a     87   29

In [179]:
df.rename(
    columns={"three": "foo", "two": "bar"},
    index={"a": "apple"},  # ÊÉ≥‰øÆÊîπÂá†‰∏™Â∞±‰øÆÊîπÂá†‰∏™
)

       foo  bar
b       42   -5
d       85   -9
apple   87   29

In [173]:
df

   three  two
b     42   -5
d     85   -9
a     87   29

In [174]:
# DataFrame.rename() also supports an ‚Äúaxis-style‚Äù calling convention, 
# where you specify a single mapper and the axis to apply that mapping to.
df.rename({"three": "foo", "two": "bar"}, axis=1)  # ÊàñËÄÖ axis='columns'

   foo  bar
b   42   -5
d   85   -9
a   87   29

In [177]:
df.rename({'d': 888888888888}, axis=0)  # ÊÉ≥‰øÆÊîπÂá†‰∏™Â∞±‰øÆÊîπÂá†‰∏™ÔºÅÔºÅÔºÅ

              three  two
b                42   -5
888888888888     85   -9
a                87   29

In [182]:
# The rename() method also provides an inplace named parameter that is by default False and copies the underlying data. 
# Pass inplace=True to rename the data in place.  
df.rename({'d': 888888888888}, axis=0, inplace=True)

In [183]:
df  # ÂèëÁé∞ df Ë¢´‰øÆÊîπ‰∫Ü

              three  two
b                42   -5
888888888888     85   -9
a                87   29

---

# iteration Ëø≠‰ª£

## In short, basic iteration (`for i in object`) produces:
- **Series**: values
- **DataFrame**: column labels

In [212]:
# ÂØπ‰∫é SeriesÔºå ÊâìÂç∞ÂÄº
s1

a    12
b    18
c    44
d    37
Name: you, dtype: int32

In [213]:
for value in s1:
    print(value)

12
18
44
37

In [214]:
# ÂØπ‰∫éDataFrameÔºåÊâìÂç∞ÂàóÊ†áÁ≠æ
df1

   one  two  three
a   57   75     66
b   16   16     80
c   49   37     69
d   22   92      8

In [215]:
for col in df1:
    print(col)

one
two
three

In [220]:
df1

   one  two  three
a   57   75     66
b   16   16     80
c   49   37     69
d   22   92      8

In [225]:
for (key, value) in df1.items():
    print(key, value, sep='\n')

one
a    57
b    16
c    49
d    22
Name: one, dtype: int32
two
a    75
b    16
c    37
d    92
Name: two, dtype: int32
three
a    66
b    80
c    69
d     8
Name: three, dtype: int32